package filter

/**
bloom filter简介

						/		/				key2			   \\\\
				//     /        key1              \\\\
	+--------+--------+--------+--------+--------+--------+--------+--------+
	|00000000|01110110|10000000|10000001|00000000|11110000|00000001|11100000|
	+--------+--------+--------+--------+--------+--------+--------+--------+

key 经过k个hash函数散列后(每次hash函数会得出一个值, 然后对m取模, 得出所在bit的位置), 经过k个函数后, 将得出的位置设置为1
所以根据该特点，可以得出如果一个key输入, 经过k个hash函数后, 所得出的k个bit的下标如果存在0的话, 那么该key铁定不在集合内
反之无法推断

k = lg2 (m/n), n代表有多少个key, m代表n个key里总共有多少个bit来存放

**/
